XiaoSenLuo/bqueue/examples/stm32f407_usart_dma.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file    usart.c
  * @brief   This file provides code for the configuration
  *          of the USART instances.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "usart.h"

/* USER CODE BEGIN 0 */
#include <stdlib.h>
#include <string.h>
#include "queue.h"

#include "dma.h"

#define UART_DATA_BUFFER_SIZE               1024            /// 定义一次性接收最大数据长度
#define UART_DEVICE_BUFFER_SIZE             32

struct usart_device_type{
    USART_TypeDef *uart;
    b_handle bqh_tx;
    b_handle bqh_rx;
    struct {
        struct {
            uint16_t dma : 2;
            uint16_t stream : 3;
            uint16_t channel : 4;
        }tx_dma;
        struct {
            uint16_t dma : 2;
            uint16_t stream : 3;
            uint16_t channel : 4;
        }rx_dma;
    };
    struct {
        uint8_t rx_idle;
        uint8_t rx_tail;
        uint8_t rx_end;
        uint8_t tx_nfree;
        uint8_t rx_buffer[UART_DEVICE_BUFFER_SIZE];
        uint8_t tx_buffer[UART_DEVICE_BUFFER_SIZE];
    };
};


typedef struct usart_device_type usart_device_t;


#define DEF_USART_BUFFER(usart, tr, size)             uint8_t usart##_##tr##_buffer[size] = { 0 }
#define USART_BUFFER_ADDRESS(usart, tr)               (usart##_##tr##_buffer)

#define DEF_USART_DEVICE(usart)                   usart_device_t usart##_device;
#define USART_DEVICE(usart)                       (usart##_device)

#define DEF_USART_QUEUE(usart, tr)                    byte_queue_t q_##usart##_##tr
#define USART_QUEUE(usart, tr)                        (q_##usart##_##tr)

#if defined(USE_USART1)

static DEF_USART_BUFFER(usart1, tx, UART_DATA_BUFFER_SIZE);
static DEF_USART_BUFFER(usart1, rx, UART_DATA_BUFFER_SIZE);
static DEF_USART_QUEUE(usart1, tx);
static DEF_USART_QUEUE(usart1, rx);

static DEF_USART_DEVICE(usart1);


#endif
#if defined(USE_USART2)

#endif
#if defined(USE_USART3)
static DEF_USART_BUFFER(usart3, tx, UART_DATA_BUFFER_SIZE);
static DEF_USART_BUFFER(usart3, rx, UART_DATA_BUFFER_SIZE);
static DEF_USART_QUEUE(usart3, tx);
static DEF_USART_QUEUE(usart3, rx);

static DEF_USART_DEVICE(usart3);

#endif

#if defined(USE_UART4)
static DEF_USART_BUFFER(uart4, tx, UART_DATA_BUFFER_SIZE);
static DEF_USART_BUFFER(uart4, rx, UART_DATA_BUFFER_SIZE);
static DEF_USART_QUEUE(uart4, tx);
static DEF_USART_QUEUE(uart4, rx);

static DEF_USART_DEVICE(uart4);
#endif
#if defined(USE_UART5)

#endif

/* USER CODE END 0 */

static usart_device_t* hdevice[6] = {
#if defined USE_USART1
        &USART_DEVICE(usart1),
#else
        NULL,
#endif
#if defined USE_USART2
        &USART_DEVICE(usart2),
#else
        NULL,
#endif
#if defined USE_USART3
        &USART_DEVICE(usart3),
#else
        NULL,
#endif
#if defined USE_UART4
        &USART_DEVICE(uart4),
#else
        NULL,
#endif
#if defined USE_UART5
        &USART_DEVICE(uart5),
#else
        NULL,
#endif
#if defined USE_USART6
        &USART_DEVICE(usart6),
#else
        NULL,
#endif
};


/* USER CODE BEGIN 1 */
static void uart_dma_config_(USART_TypeDef *USARTx,
                             DMA_TypeDef *DMAx, uint32_t Stream, LL_DMA_InitTypeDef *DMA_InitStruct){

    if(DMAx == DMA1){
        LL_AHB1_GRP1_EnableClock(LL_AHB1_GRP1_PERIPH_DMA1);
    }else if(DMAx == DMA2){
        LL_AHB1_GRP1_EnableClock(LL_AHB1_GRP1_PERIPH_DMA2);
    }else{
        return;
    }
    LL_DMA_DisableStream(DMAx, Stream);
    LL_DMA_EnableIT_HT(DMAx, Stream);
    LL_DMA_EnableIT_TC(DMAx, Stream);
    LL_DMA_Init(DMAx, Stream, DMA_InitStruct);
    LL_DMA_DisableIT_TE(DMAx, Stream);
}

static void uart_rx_dma_config_(USART_TypeDef *USARTx,
                                DMA_TypeDef *DMAx, uint32_t Stream, LL_DMA_InitTypeDef *DMA_InitStruct){

    LL_USART_Enable(USARTx);

    LL_DMA_DisableStream(DMAx, Stream);
    LL_DMA_Init(DMAx, Stream, DMA_InitStruct);
    LL_DMA_DisableIT_TE(DMAx, Stream);
    LL_DMA_EnableIT_HT(DMAx, Stream);
    LL_DMA_EnableIT_TC(DMAx, Stream);
    LL_DMA_EnableStream(DMAx, Stream);

    LL_USART_EnableDMAReq_RX(USARTx);
    LL_USART_EnableIT_IDLE(USARTx);
    LL_USART_EnableIT_ERROR(USARTx);
}

static void uart_tx_dma_config_(USART_TypeDef *USARTx,
                                DMA_TypeDef *DMAx, uint32_t Stream, LL_DMA_InitTypeDef *DMA_InitStruct){
    LL_USART_Enable(USARTx);

    LL_DMA_DisableStream(DMAx, Stream);
    LL_DMA_Init(DMAx, Stream, DMA_InitStruct);
    LL_DMA_DisableIT_TE(DMAx, Stream);
    LL_DMA_DisableIT_HT(DMAx, Stream);
    LL_DMA_EnableIT_TC(DMAx, Stream);
    LL_DMA_EnableStream(DMAx, Stream);

    LL_USART_EnableDMAReq_TX(USARTx);
    LL_USART_EnableIT_ERROR(USARTx);
}

static void usart_rx_dma_circle_post_(usart_device_t *device, DMA_TypeDef *DMAx, uint32_t Stream){

//    CRIT_SEC_E_;
    const uint8_t rx_head = LL_DMA_GetDataLength(DMAx, Stream);
    const uint8_t rx_end = device->rx_end;
    const uint8_t rx_tail = device->rx_tail;

//    device->rx_tail = rx_head;

    /**
     * @brief 当TC置位时, DMA Data Length 会重新加载
     */

    /// 索引递减类型
    /// new head
//    device->rx_head = rx_head;
    /// post data to user's buffer queue
    if((rx_head == rx_tail)){
        if((rx_head == (rx_end >> 1))){
            /// only enable HT

        }else if((rx_head == rx_end)){
            /// only enalbe TC
        }else{
            goto end_section;
        }
    }else{
        /// enable TC, HT
        uint8_t available = 0;
        if((rx_head > rx_tail)){
            /// 比前一次大, 说明循环从头再来
            available = rx_tail + (rx_end - rx_head);
            bq_post(device->bqh_rx, &device->rx_buffer[rx_end - rx_tail], rx_tail);
            bq_post(device->bqh_rx, &device->rx_buffer[0], rx_end - rx_head);
        }else{
            available = rx_tail - rx_head;
            bq_post(device->bqh_rx, &device->rx_buffer[rx_end - rx_tail], available);
        }
    }

    /// new tail
    device->rx_tail = rx_head;
    end_section:
    return;
//    CRIT_SEC_X_;
}

static void usart_tx_circle_get_(usart_device_t *device, DMA_TypeDef *DMAx, uint32_t Stream){
    (void)DMAx;
    (void)Stream;

