XiaoSenLuo/bqueue/examples/stm32f407_usart_dma.c
    usart_device_t *dev = (usart_device_t *)ctx;

    if(LL_DMA_IsEnabledIT_TC(DMA[dev->tx_dma.dma], DMA_STREAM[dev->tx_dma.stream])
       && ll_dma_get_sr_state(DMA[dev->tx_dma.dma], DMA_STREAM[dev->tx_dma.stream], DMA_LISR_TCIF0)){

        ll_dma_clear_sr_state(DMA[dev->tx_dma.dma], DMA_STREAM[dev->tx_dma.stream], DMA_LISR_TCIF0);
        LL_DMA_DisableStream(DMA[dev->tx_dma.dma], DMA_STREAM[dev->tx_dma.stream]);
        LL_DMA_DisableIT_TC(DMA[dev->tx_dma.dma], DMA_STREAM[dev->tx_dma.stream]);

        LL_USART_DisableDMAReq_TX(dev->uart);

        usart_tx_circle_get_(dev, DMA[dev->tx_dma.dma], DMA_STREAM[dev->tx_dma.stream]);

        LL_USART_EnableIT_TC(dev->uart);
    }
}


static void uart1_tx_dma_isr_handler_(void *ctx){

    usart_device_t *dev = (usart_device_t *)ctx;

    if(LL_DMA_IsEnabledIT_TC(DMA[dev->tx_dma.dma], DMA_STREAM[dev->tx_dma.stream])
       && ll_dma_get_sr_state(DMA[dev->tx_dma.dma], DMA_STREAM[dev->tx_dma.stream], DMA_LISR_TCIF0)){

        ll_dma_clear_sr_state(DMA[dev->tx_dma.dma], DMA_STREAM[dev->tx_dma.stream], DMA_LISR_TCIF0);
        LL_DMA_DisableStream(DMA[dev->tx_dma.dma], DMA_STREAM[dev->tx_dma.stream]);
        LL_DMA_DisableIT_TC(DMA[dev->tx_dma.dma], DMA_STREAM[dev->tx_dma.stream]);

        LL_USART_DisableDMAReq_TX(dev->uart);

        usart_tx_circle_get_(dev, DMA[dev->tx_dma.dma], DMA_STREAM[dev->tx_dma.stream]);

        LL_USART_EnableIT_TC(dev->uart);
    }
}

static void uart_rx_dma_isr_handler_(void *ctx){
    usart_device_t *dev = (usart_device_t *)ctx;
    if(LL_DMA_IsEnabledIT_HT(DMA[dev->rx_dma.dma], DMA_STREAM[dev->rx_dma.stream])
       && ll_dma_get_sr_state(DMA[dev->rx_dma.dma], DMA_STREAM[dev->rx_dma.stream], DMA_LISR_HTIF0)){
        ll_dma_clear_sr_state(DMA[dev->rx_dma.dma], DMA_STREAM[dev->rx_dma.stream], DMA_LISR_HTIF0);
        usart_rx_dma_circle_post_(dev, DMA[dev->rx_dma.dma], DMA_STREAM[dev->rx_dma.stream]);
    }

    if(LL_DMA_IsEnabledIT_TC(DMA[dev->rx_dma.dma], DMA_STREAM[dev->rx_dma.stream])
       && ll_dma_get_sr_state(DMA[dev->rx_dma.dma], DMA_STREAM[dev->rx_dma.stream], DMA_LISR_TCIF0)){
        ll_dma_clear_sr_state(DMA[dev->rx_dma.dma], DMA_STREAM[dev->rx_dma.stream], DMA_LISR_TCIF0);
        usart_rx_dma_circle_post_(dev, DMA[dev->rx_dma.dma], DMA_STREAM[dev->rx_dma.stream]);
    }
}

static void uart1_rx_dma_isr_handler_(void *ctx){
    usart_device_t *dev = (usart_device_t *)ctx;
    if(LL_DMA_IsEnabledIT_HT(DMA[dev->rx_dma.dma], DMA_STREAM[dev->rx_dma.stream])
       && ll_dma_get_sr_state(DMA[dev->rx_dma.dma], DMA_STREAM[dev->rx_dma.stream], DMA_LISR_HTIF0)){
        ll_dma_clear_sr_state(DMA[dev->rx_dma.dma], DMA_STREAM[dev->rx_dma.stream], DMA_LISR_HTIF0);
        usart_rx_dma_circle_post_(dev, DMA[dev->rx_dma.dma], DMA_STREAM[dev->rx_dma.stream]);
    }

    if(LL_DMA_IsEnabledIT_TC(DMA[dev->rx_dma.dma], DMA_STREAM[dev->rx_dma.stream])
       && ll_dma_get_sr_state(DMA[dev->rx_dma.dma], DMA_STREAM[dev->rx_dma.stream], DMA_LISR_TCIF0)){
        ll_dma_clear_sr_state(DMA[dev->rx_dma.dma], DMA_STREAM[dev->rx_dma.stream], DMA_LISR_TCIF0);
        usart_rx_dma_circle_post_(dev, DMA[dev->rx_dma.dma], DMA_STREAM[dev->rx_dma.stream]);
    }
}

static void uart3_dma_isr_handler_(void *ctx){

}


int uart_initialize(const uint8_t index, const uart_initialize_t *initialize) {
     uint32_t gpio[6][4] = {
            {/* TX */ (uint32_t)GPIOB, LL_GPIO_PIN_6, /* RX */ (uint32_t)GPIOB, LL_GPIO_PIN_7 },
            {/* TX */ UINT32_MAX, UINT32_MAX, /* RX */ UINT32_MAX, UINT32_MAX },
            {/* TX */ (uint32_t)GPIOB, LL_GPIO_PIN_10, /* RX */ (uint32_t)GPIOB, LL_GPIO_PIN_11 },
            {/* TX */ (uint32_t)GPIOC, LL_GPIO_PIN_10, /* RX */ (uint32_t)GPIOC, LL_GPIO_PIN_11 },
            {/* TX */ (uint32_t)GPIOC, LL_GPIO_PIN_12, /* RX */ (uint32_t)GPIOD, LL_GPIO_PIN_2 },
            {/* TX */ UINT32_MAX, UINT32_MAX, /* RX */ UINT32_MAX, UINT32_MAX },
    };

    uint32_t af[6][2] = {
            {LL_GPIO_AF_7, LL_GPIO_AF_7},
            {UINT32_MAX, UINT32_MAX},
            {LL_GPIO_AF_7, LL_GPIO_AF_7},
            {LL_GPIO_AF_8, LL_GPIO_AF_8},
            {LL_GPIO_AF_8, LL_GPIO_AF_8},
            {UINT32_MAX, UINT32_MAX},
    };

    uint8_t irqn[6] = {
            USART1_IRQn,
            USART2_IRQn,
            USART3_IRQn,
            UART4_IRQn,
            UART5_IRQn,
            USART6_IRQn,
    };

//    USART_TypeDef *uart[6] = {
//            USART1,
//            USART2,
//            USART3,
//            UART4,
//            UART5,
//            USART6
//    };

//    void (*handler[6])(void *)  = {
//            &usart_isr_handler_,
//            &usart_isr_handler_,
//            &usart_isr_handler_,
//            NULL,
//            NULL,
//            NULL,
//    };

    LL_USART_InitTypeDef USART_InitStruct = {0};
    LL_GPIO_InitTypeDef GPIO_InitStruct = {0};

    const uint8_t id = index - 1;

    USART_InitStruct.BaudRate = initialize->baud;
    USART_InitStruct.DataWidth = (initialize->data_bit == 9) ? LL_USART_DATAWIDTH_9B : LL_USART_DATAWIDTH_8B;
    USART_InitStruct.StopBits = (initialize->stop_bit == 1) ? LL_USART_STOPBITS_1 : LL_USART_STOPBITS_2;
    USART_InitStruct.Parity = (initialize->parity == 0) ? LL_USART_PARITY_NONE : ((initialize->parity == 1) ? LL_USART_PARITY_EVEN : LL_USART_PARITY_ODD);
    USART_InitStruct.TransferDirection = LL_USART_DIRECTION_TX_RX;

    if(initialize->hwcontrol.value == 0){
        USART_InitStruct.HardwareFlowControl = LL_USART_HWCONTROL_NONE;
    }else if(initialize->hwcontrol.cts && initialize->hwcontrol.rts){
        USART_InitStruct.HardwareFlowControl = LL_USART_HWCONTROL_RTS_CTS;
    }else if(initialize->hwcontrol.cts){
        USART_InitStruct.HardwareFlowControl = LL_USART_HWCONTROL_CTS;
    }else{
        USART_InitStruct.HardwareFlowControl = LL_USART_HWCONTROL_RTS;
    }
    USART_InitStruct.OverSampling = LL_USART_OVERSAMPLING_16;

#if defined(USE_USART1)
    if(index == 1){
        LL_APB2_GRP1_EnableClock(LL_APB2_GRP1_PERIPH_USART1);

