XiaoSenLuo/bqueue/examples/stm32f407_usart_dma.c
        USART_DEVICE(usart1).bqh_rx = bq_initialize(&USART_QUEUE(usart1, rx),
                                                    USART_BUFFER_ADDRESS(usart1, rx), UART_DATA_BUFFER_SIZE);
        USART_DEVICE(usart1).bqh_tx = bq_initialize(&USART_QUEUE(usart1, tx),
                                                    USART_BUFFER_ADDRESS(usart1, tx), UART_DATA_BUFFER_SIZE);

        USART_DEVICE(usart1).rx_end = sizeof(USART_DEVICE(usart1).rx_buffer);
        USART_DEVICE(usart1).rx_tail = USART_DEVICE(usart1).rx_end;
//        USART_DEVICE(usart1).rx_head = USART_DEVICE(usart1).rx_end;
        USART_DEVICE(usart1).tx_nfree = UINT8_MAX;

        USART_DEVICE(usart1).uart = USART1;
#ifdef USART1_TX_USE_DMA
        USART_DEVICE(usart1).tx_dma.dma = 2 - 1;
        USART_DEVICE(usart1).tx_dma.stream = (uint8_t)7;
        USART_DEVICE(usart1).tx_dma.channel = (uint8_t)4;
#endif
#ifdef USART1_RX_USE_DMA
        USART_DEVICE(usart1).rx_dma.dma = 2 - 1;
        USART_DEVICE(usart1).rx_dma.stream = (uint8_t)2;
        USART_DEVICE(usart1).rx_dma.channel = (uint8_t)4;
#endif
    }
#endif
#if defined (USE_USART2)

#endif
#if defined(USE_USART3)
    if(index == 3){
        LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_USART3);

        USART_DEVICE(usart3).bqh_rx = bq_initialize(&USART_QUEUE(usart3, rx),
                                                    USART_BUFFER_ADDRESS(usart3, rx), UART_DATA_BUFFER_SIZE);
        USART_DEVICE(usart3).bqh_tx = bq_initialize(&USART_QUEUE(usart3, tx),
                                                    USART_BUFFER_ADDRESS(usart3, tx), UART_DATA_BUFFER_SIZE);

        USART_DEVICE(usart3).rx_end = sizeof(USART_DEVICE(usart3).rx_buffer);
        USART_DEVICE(usart3).rx_tail = USART_DEVICE(usart3).rx_end;
//        USART_DEVICE(usart3).rx_head = USART_DEVICE(usart3).rx_end;
        USART_DEVICE(usart3).tx_nfree = UINT8_MAX;

        USART_DEVICE(usart3).uart = USART3;
#ifdef USART3_TX_USE_DMA
        USART_DEVICE(usart3).tx_dma.dma = 1 - 1;
        USART_DEVICE(usart3).tx_dma.stream = (uint8_t)3;
        USART_DEVICE(usart3).tx_dma.channel = (uint8_t)4;
#endif
#ifdef USART3_RX_USE_DMA
        USART_DEVICE(usart3).rx_dma.dma = 1 - 1;
        USART_DEVICE(usart3).rx_dma.stream = (uint8_t)1;
        USART_DEVICE(usart3).rx_dma.channel = (uint8_t)4;
#endif
    }
#endif
#if defined(USE_UART4)
    if(index == 4){
        LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_UART4);

        USART_DEVICE(uart4).bqh_rx = bq_initialize(&USART_QUEUE(uart4, rx),
                                                    USART_BUFFER_ADDRESS(uart4, rx), UART_DATA_BUFFER_SIZE);
        USART_DEVICE(uart4).bqh_tx = bq_initialize(&USART_QUEUE(uart4, tx),
                                                    USART_BUFFER_ADDRESS(uart4, tx), UART_DATA_BUFFER_SIZE);

        USART_DEVICE(uart4).rx_end = sizeof(USART_DEVICE(uart4).rx_buffer);
        USART_DEVICE(uart4).rx_tail = USART_DEVICE(uart4).rx_end;
//        USART_DEVICE(uart4).rx_head = USART_DEVICE(uart4).rx_end;
        USART_DEVICE(uart4).tx_nfree = UINT8_MAX;

        USART_DEVICE(uart4).uart = UART4;
#ifdef USART3_TX_USE_DMA
        USART_DEVICE(uart4).tx_dma.dma = 1 - 1;
        USART_DEVICE(uart4).tx_dma.stream = (uint8_t)4;
        USART_DEVICE(uart4).tx_dma.channel = (uint8_t)4;
#endif
#ifdef USART3_RX_USE_DMA
        USART_DEVICE(uart4).rx_dma.dma = 1 - 1;
        USART_DEVICE(uart4).rx_dma.stream = (uint8_t)2;
        USART_DEVICE(uart4).rx_dma.channel = (uint8_t)4;
#endif
    }
#endif
    for(int i = 0; i < (sizeof(hdevice) / sizeof(usart_device_t *)); i++){
        if(i != id) continue;
        if(hdevice[i] == NULL) break;

        LL_USART_DeInit(hdevice[id]->uart);
        LL_USART_Init(hdevice[id]->uart, &USART_InitStruct);

        LL_USART_ConfigAsyncMode(hdevice[id]->uart);

        ll_peripheral_isr_install((int)irqn[i], &usart_isr_handler_, (void *)hdevice[id]);
        NVIC_SetPriority(irqn[i], NVIC_EncodePriority(NVIC_GetPriorityGrouping(),3, 0));

        NVIC_EnableIRQ(irqn[i]);

        /// TX
        GPIO_InitStruct.Pin = gpio[i][1];;
        GPIO_InitStruct.Mode = LL_GPIO_MODE_ALTERNATE;
        GPIO_InitStruct.Speed = LL_GPIO_SPEED_FREQ_VERY_HIGH;
        GPIO_InitStruct.OutputType = LL_GPIO_OUTPUT_PUSHPULL;
        GPIO_InitStruct.Pull = LL_GPIO_PULL_NO;
        GPIO_InitStruct.Alternate = af[i][0];
        LL_GPIO_Init((GPIO_TypeDef *)gpio[i][0], &GPIO_InitStruct);
        /// RX
        GPIO_InitStruct.Pin = gpio[i][3];;
        GPIO_InitStruct.Mode = LL_GPIO_MODE_ALTERNATE;
        GPIO_InitStruct.Speed = LL_GPIO_SPEED_FREQ_VERY_HIGH;
        GPIO_InitStruct.OutputType = LL_GPIO_OUTPUT_PUSHPULL;
        GPIO_InitStruct.Pull = LL_GPIO_PULL_NO;
        GPIO_InitStruct.Alternate = af[i][1];
        LL_GPIO_Init((GPIO_TypeDef *)gpio[i][2], &GPIO_InitStruct);

        break;
    }

    return 0;
}

int uart_deinitialize(const uint8_t index){
    (void)index;
    return 0;
}


void uart_start_receive_async(const uint8_t index){
    LL_DMA_InitTypeDef dmaInitTypeDef = {
            .Channel = LL_DMA_CHANNEL_4,
            .Direction = LL_DMA_DIRECTION_PERIPH_TO_MEMORY,
            .Mode = LL_DMA_MODE_CIRCULAR,
            .Priority = LL_DMA_PRIORITY_HIGH,
            .PeriphOrM2MSrcIncMode = LL_DMA_PERIPH_NOINCREMENT,
            .PeriphOrM2MSrcDataSize = LL_DMA_PDATAALIGN_BYTE,
            .MemoryOrM2MDstIncMode = LL_DMA_MEMORY_INCREMENT,
            .MemoryOrM2MDstDataSize = LL_DMA_MDATAALIGN_BYTE,
            .FIFOMode = LL_DMA_FIFOMODE_DISABLE,
    };
    uint8_t dma_irq[sizeof(DMA) / sizeof(DMA_TypeDef *)][sizeof(DMA_STREAM) / sizeof(uint32_t)] = {
            {DMA1_Stream0_IRQn, DMA1_Stream1_IRQn, DMA1_Stream2_IRQn, DMA1_Stream3_IRQn,
             DMA1_Stream4_IRQn, DMA1_Stream5_IRQn, DMA1_Stream6_IRQn, DMA1_Stream7_IRQn },
            {DMA2_Stream0_IRQn, DMA2_Stream1_IRQn, DMA2_Stream2_IRQn, DMA2_Stream3_IRQn,
             DMA2_Stream4_IRQn, DMA2_Stream5_IRQn, DMA2_Stream6_IRQn, DMA2_Stream7_IRQn },
    };
    const int id = index - 1;
    for(int i = 0; i < (sizeof(hdevice) / sizeof(usart_device_t *)); i++){
        if(i != id) continue;
        if(hdevice[i] == NULL) break;
        dmaInitTypeDef.Channel = DMA_CHANNEL[hdevice[id]->rx_dma.channel];
        dmaInitTypeDef.PeriphOrM2MSrcAddress = LL_USART_DMA_GetRegAddr(hdevice[id]->uart);
        dmaInitTypeDef.MemoryOrM2MDstAddress = (uint32_t)(hdevice[id]->rx_buffer);
        dmaInitTypeDef.NbData = sizeof(hdevice[id]->rx_buffer);

        ll_peripheral_isr_install(dma_irq[hdevice[id]->rx_dma.dma][hdevice[id]->rx_dma.stream],
                                  &uart_rx_dma_isr_handler_, hdevice[id]);

        uart_rx_dma_config_(hdevice[id]->uart,
                            DMA[hdevice[id]->rx_dma.dma], DMA_STREAM[hdevice[id]->rx_dma.stream],
                            &dmaInitTypeDef);

        NVIC_SetPriority(dma_irq[hdevice[id]->rx_dma.dma][hdevice[id]->rx_dma.stream],
                         NVIC_EncodePriority(NVIC_GetPriorityGrouping(),3, 0));

        NVIC_EnableIRQ(dma_irq[hdevice[id]->rx_dma.dma][hdevice[id]->rx_dma.stream]);
        break;
    }
}

void uart_stop_receive_async(const uint8_t index){
    const int id = index - 1;
    for(int i = 0; i < (sizeof(hdevice) / sizeof(usart_device_t *)); i++){
        if(i != id) continue;
        if(hdevice[i] == NULL) break;
        LL_USART_Disable(hdevice[id]->uart);
        LL_USART_DisableIT_IDLE(hdevice[id]->uart);
        LL_USART_DisableDMAReq_RX(hdevice[id]->uart);
        LL_DMA_DisableStream(DMA[hdevice[id]->rx_dma.dma], DMA_STREAM[hdevice[id]->rx_dma.stream]);
        LL_USART_ReceiveData8(hdevice[id]->uart);
        break;
    }
}


uint16_t uart_write_bytes(const uint8_t index, void *data, uint16_t length, uint32_t timeout_ms){
    LL_DMA_InitTypeDef dmaInitTypeDef = {
            .Channel = LL_DMA_CHANNEL_4,
            .Direction = LL_DMA_DIRECTION_MEMORY_TO_PERIPH,
            .Mode = LL_DMA_MODE_NORMAL,
            .Priority = LL_DMA_PRIORITY_HIGH,
            .PeriphOrM2MSrcIncMode = LL_DMA_PERIPH_NOINCREMENT,
            .PeriphOrM2MSrcDataSize = LL_DMA_PDATAALIGN_BYTE,
            .MemoryOrM2MDstIncMode = LL_DMA_MEMORY_INCREMENT,
            .MemoryOrM2MDstDataSize = LL_DMA_MDATAALIGN_BYTE,
            .FIFOMode = LL_DMA_FIFOMODE_DISABLE,
    };
    uint16_t offset = 0;
    uint8_t dma_irq[sizeof(DMA) / sizeof(DMA_TypeDef *)][sizeof(DMA_STREAM) / sizeof(uint32_t)] = {
            {DMA1_Stream0_IRQn, DMA1_Stream1_IRQn, DMA1_Stream2_IRQn, DMA1_Stream3_IRQn,
                    DMA1_Stream4_IRQn, DMA1_Stream5_IRQn, DMA1_Stream6_IRQn, DMA1_Stream7_IRQn },
            {DMA2_Stream0_IRQn, DMA2_Stream1_IRQn, DMA2_Stream2_IRQn, DMA2_Stream3_IRQn,
                    DMA2_Stream4_IRQn, DMA2_Stream5_IRQn, DMA2_Stream6_IRQn, DMA2_Stream7_IRQn },
    };

    const uint8_t id = index - 1;

    for(int i = 0; i < (sizeof(hdevice) / sizeof(usart_device_t *)); i++){
        if(i != id) continue;
        if(hdevice[i] == NULL) break;
        CRIT_SEC_E_;
        const uint8_t tx_nfree = hdevice[id]->tx_nfree;
        const uint16_t nsend = length > sizeof(hdevice[id]->tx_buffer) ? sizeof(hdevice[id]->tx_buffer) : length;

        dmaInitTypeDef.PeriphOrM2MSrcAddress = LL_USART_DMA_GetRegAddr(hdevice[id]->uart);
        dmaInitTypeDef.MemoryOrM2MDstAddress = (uint32_t)(hdevice[id]->tx_buffer);
        dmaInitTypeDef.Channel = DMA_CHANNEL[hdevice[id]->tx_dma.channel];

        if(tx_nfree == UINT8_MAX){
            /// 串口空闲
            dmaInitTypeDef.NbData = nsend;
            hdevice[id]->tx_nfree = sizeof(hdevice[id]->tx_buffer) - nsend;
            for(offset = 0; offset < nsend; offset++){
                hdevice[id]->tx_buffer[offset] = ((uint8_t *)data)[offset];
            }
        }else if(tx_nfree == sizeof(hdevice[id]->tx_buffer)){
            /// 发送缓冲区空, 但最后一帧未发送完成
            dmaInitTypeDef.NbData = nsend;
            hdevice[id]->tx_nfree = sizeof(hdevice[id]->tx_buffer) - nsend;
            for(offset = 0; offset < nsend; offset++){
                hdevice[id]->tx_buffer[offset] = ((uint8_t *)data)[offset];
            }
        }
        CRIT_SEC_X_;
        /// 开始发送
        if(tx_nfree == UINT8_MAX){
            ll_peripheral_isr_install(dma_irq[hdevice[id]->tx_dma.dma][hdevice[id]->tx_dma.stream],
                                      &uart_tx_dma_isr_handler_, hdevice[id]);
            NVIC_SetPriority(dma_irq[hdevice[id]->tx_dma.dma][hdevice[id]->tx_dma.stream],
                             NVIC_EncodePriority(NVIC_GetPriorityGrouping(),4, 0));
            NVIC_EnableIRQ(dma_irq[hdevice[id]->tx_dma.dma][hdevice[id]->tx_dma.stream]);
            uart_tx_dma_config_(hdevice[id]->uart,
                                DMA[hdevice[id]->tx_dma.dma], DMA_STREAM[hdevice[id]->tx_dma.stream],
                                &dmaInitTypeDef);
        }
        /// 将数据填入循环缓冲区
        uint16_t remain = length - offset;

        const uint16_t tx_end = bq_full_size(&hdevice[id]->bqh_tx);

        while(remain > 0){
            uint16_t npost = 0;
            npost = bq_get_free(hdevice[id]->bqh_tx);
            if(timeout_ms && (npost == 0)){
                HAL_Delay(1);
                --timeout_ms;
                if(timeout_ms == 0) break;
                continue;
            }
//            if(!((npost >= (remain >> 1)) || (npost >= (tx_end >> 1)))) continue;

            npost = npost > remain ? remain : npost;
            npost = bq_post(hdevice[id]->bqh_tx, &data[offset], npost);
            offset += npost;
            remain -= npost;
        }
        break;
    }

    CRIT_SEC_X_;
    return offset;
}


uint16_t uart_available_bytes(const uint8_t index){
    const uint8_t id = index - 1;
    uint16_t al = 0;
    for(int i = 0; i < (sizeof(hdevice) / sizeof(usart_device_t *)); i++){
        if(i != id) continue;
        if(hdevice[i] == NULL) break;
        al = bq_length(hdevice[id]->bqh_rx);
        break;
    }
    return al;
}

uint16_t uart_read_bytes(const uint8_t index, void *data, uint16_t length, uint32_t timeout_ms){
    uint16_t rl = 0;
    uint16_t remain = length;
    const uint8_t id = index - 1;
    for(int i = 0; i < (sizeof(hdevice) / sizeof(usart_device_t *)); i++){
        if(i != id) continue;
        if(hdevice[i] == NULL) break;
        do{
            read_section:
            rl = bq_get(hdevice[id]->bqh_rx, &data[length - remain], remain);
            remain -= rl;
            if(remain == 0) break;
            if((rl == 0) && timeout_ms){
                HAL_Delay(1);
                --timeout_ms;
                if((timeout_ms == 0) && bq_length(&hdevice[id]->bqh_rx)){
                    goto read_section;
                }
            }
        }while(timeout_ms);
        break;
    }
    return length - remain;
}

#include <stdio.h>
#ifdef __GNUC__
/* With GCC, small printf (option LD Linker->Libraries->Small printf
   set to 'Yes') calls __io_putchar() */
#define PUTCHAR_PROTOTYPE int __io_putchar(int ch)
#else
#define PUTCHAR_PROTOTYPE int fputc(int ch, FILE *f)
#endif /* __GNUC__ */

PUTCHAR_PROTOTYPE
{
    /* Place your implementation of fputc here */
    /* e.g. write a character to the USART1 and Loop until the end of transmission */
    uint32_t timeout = 1000;
    while(LL_USART_IsEnabledDMAReq_TX(USART1) && timeout){
        HAL_Delay(1);
        timeout--;
    }
    while((!LL_USART_IsActiveFlag_TXE(USART1)) && timeout){
        HAL_Delay(1);
        timeout--;
    }
    if(timeout){
        LL_USART_ClearFlag_TC(USART1);
        LL_USART_TransmitData8(USART1, ch);
        while(!LL_USART_IsActiveFlag_TC(USART1)){

        }
        LL_USART_ClearFlag_TC(USART1);
    }

    return ch;
}

#include "printf/printf.h"
void putchar_(char ch){
    uint8_t d = ch;
    uart_write_bytes(1, &d, 1, 0);
}


uint8_t uart_printf(uint8_t index, const char *format, ...){

    return 0;
}



/* USER CODE END 1 */
